uses graphABC;
begin
{горшок}
setpencolor(clBrown);
setbrushcolor(clBrown);
Line(52, 280, 110, 452);
Line(110, 452, 196, 452);
Line(196, 452, 243, 280);
Line(243, 280, 52, 280);
{зальём горшок цветом}
floodfill(120, 400, clBrown);
{стебли}
setpenwidth(5);
setpencolor(clGreen);
Line(58, 129, 127, 277);
Line(142, 56, 142, 280);
Line(229, 123, 164, 278);
{лепестки цветов}
setpencolor(clPurple);
Line(44, 101, 29, 70);
Line(45, 98, 67, 68);
Line(55, 95, 55, 64);
Line(55, 95, 74, 73);
Line(71, 99, 83, 81);
Line(71, 110, 95, 109);
Line(73, 116, 92, 123);
Line(60, 122, 83, 135);
Line(50, 132, 48, 145);
Line(49, 132, 33, 143);
Line(41, 123, 19, 133);
Line(43, 115, 13, 124);
Line(44, 109, 14, 108);
Line(37, 103, 17, 94);
Line(136, 50, 131, 64);
Line(135, 46, 117, 67);
Line(125, 48, 98, 62);
Line(135, 38, 102, 37);
Line(130, 30, 103, 22);
Line(128, 22, 112, 7);
Line(146, 12, 155, -6);
Line(158, 14, 166, -7);
Line(159, 28, 175, 12);
Line(163, 40, 191, 47);
Line(158, 47, 172, 58);
Line(147, 49, 162, 68);
Line(134, 19, 129, 6);
Line(218, 91, 210, 78);
Line(216, 91, 198, 80);
Line(225, 83, 213, 60);
Line(243, 88, 240, 62);
Line(251, 89, 267, 74);
Line(255, 106, 278, 110);
Line(245, 116, 264, 132);
Line(238, 118, 248, 142);
Line(231, 125, 232, 141);
Line(219, 112, 197, 129);
Line(219, 112, 183, 108);
{середины цветков}
setpencolor(clYellow);
setbrushcolor(clYellow);
Circle(53, 116, 16);
Circle(142, 37, 17);
Circle(231, 103, 20);
end.